# Задание 20

# Даны три различных целых числа. Напишите программу, которая находит серединное значение из этих чисел.

# Формат входных данных
# На вход программе подаются три различных целых числа, каждое на отдельной строке.

# Формат выходных данных
# Программа должна вывести серединное значение из набора трёх чисел.

# Примечание. Серединное значение набора чисел – это число, которое находится в середине этого набора, если его упорядочить по возрастанию.

a = int(input()) # 1
b = int(input()) # 2
c = int(input()) # 3

# нужно решение
