# Задание 4

# Напишите программу, которая определяет наименьшее из двух чисел.

# Формат входных данных
# На вход программе подаются два различных целых числа.

# Формат выходных данных
# Программа должна вывести наименьшее из двух чисел.

num1, num2 = int(input()), int(input())
if num1 > num2 :
    print(num2)
else :
    print(num1)
