# Задание 1.

# Напишите программу, которая выводит на экран следующий текст:
# Здравствуй, мир!

print('Здравствуй, мир!')
