# Задание 4

# Напишите программу, которая выводит следующий треугольник, состоящий из звёздочек (*):

# *
# **
# ***
# ****
# *****
# ******
# *******

print('*')
print('**')
print('***')
print('****')
print('*****')
print('******')
print('*******')