# Задание 5

# На вход программе подаётся строка текста – имя человека. Напишите программу, которая принимает эту строку текста через стандартный поток ввода (команда input()). Далее программа должна выводить на экран приветствие в следующем формате:

# Привет, <имя человека>

# Формат входных данных
# На вход программе подаётся одна строка – имя человека.

# Примечание 1. Для считывания текста используйте команду input(), для печати текста на экране используйте команду print().

# Примечание 2. Обратите внимание на то, что ваша программа прогоняется сразу на нескольких тестах. Поэтому решение должно быть универсальным, то есть оно должно выводить текст исходя из входных данных, которые поступают вашей программе на вход.

name = input()
print('Привет,', name)