# Задание 7

# Напишите программу, которая принимает через стандартный поток ввода (команда input()) три строки, а затем выводит их в той же последовательности, каждую на отдельной строке.

# Формат входных данных
# На вход программе подаются три строки, каждая на отдельной строке.

# Примечание 1. Для считывания текста используйте команду input(), для печати текста на экране используйте команду print().

# Примечание 2. Обратите внимание на то, что ваша программа прогоняется сразу на нескольких тестах. Поэтому решение должно быть универсальным, то есть оно должно выводить текст исходя из входных данных, которые поступают вашей программе на вход.

a = input()
b = input()
c = input()

print(a)
print(b)
print(c)