# Задание 9

# Напишите программу, которая выводит на экран следующий текст:

# I***like***Python

# Примечание. Используйте необязательный параметр sep.

print('I', 'like', 'Python', sep='***')