# Задание 13

# Напишите программу, которая выводит текст:

# "Python is a great language!", said Fred. "I don't ever remember having this much fun before."
                  
# Примечание. Используйте конкатенацию строк.

string = '"Python is a great language!", said Fred. "I ' + "don't " + 'ever remember having this much fun before."'
print(string)